АлогистикТест2/src/Documents/алк_ПогрузкаСудовыхПартий/алк_ПогрузкаСудовыхПартий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПогрузкаСудовыхПартий</name>
  <basedOn>Document.алк_ТранспортировочныеПартии</basedOn>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаВнешнихСкладахСерии</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ТранспортировочныеПартии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЭкспедитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ПогрузкаСудовыхПартий/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	// Процедура - обработчик события ОбработкаЗаполнения.	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
			
			Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
				ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
			КонецЕсли; 
			
		Иначе
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.алк_ТранспортировочныеПартии")] = "ЗаполнитьПоТранспортировочнойПартии";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);	
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	// Процедура - обработчик события ОбработкаПроведения объекта.
	//
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		// Инициализация дополнительных свойств для проведения документа.
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа.
		Документы.алк_ПогрузкаСудовыхПартий.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей.
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета.
		РфпСервер.ОтразитьЗапасыНаВнешнихСкладахСерии(ДополнительныеСвойства, Движения, Отказ);
		
		Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда
			РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
		КонецЕсли;
		
		// СерийныеНомера
		//УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
		//ПРОВЕРКА
		РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.Проведение); 
		//\\
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область ПроцедурыЗаполненияДокумента
	
	// Обработчик заполнения на основании данных заполнения.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура.
	//
	Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
		
		Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			
			ОнЖе = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗаполнитьЗапасыПоДокументыОснования();
		
	КонецПроцедуры
	
	// Обработчик заполнения документа по структуре
	//
	// Параметры:
	//
	Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
		
		Если ДанныеЗаполнения.Свойство("Заказ") Тогда
			Заказ = ДанныеЗаполнения.Заказ;	
		КонецЕсли; 
		
		//Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		//	СтруктурнаяЕдиница = ДанныеЗаполнения.Заказ;	
		//КонецЕсли; 
		
	КонецПроцедуры
	
	// Обработчик заполнения документа на основании Транспортировочной партии.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
	//
	Процедура ЗаполнитьПоТранспортировочнойПартии(ДанныеЗаполнения, Операция = "") Экспорт
		
		// Заполнение шапки документа.
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		ЭтотОбъект.КонтрагентЭкспедитор = ДанныеЗаполнения.КонтрагентЭкспедитор;
		
		//ЛогистическийЦентрПолучатель = ДанныеЗаполнения.ЛогистическийЦентрПолучатель;
		//СтруктурнаяЕдиницаПолучатель = ДанныеЗаполнения.СтруктурнаяЕдиницаПолучатель;
		Заказ                        = ДанныеЗаполнения.Заказ;
		
		Для каждого стрЗапас Из ДанныеЗаполнения.Запасы Цикл
			
			НоваяСтрока = Запасы.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, стрЗапас);
			
		КонецЦикла; 
		
		Запасы.Сортировать("СерийныйНомер");
		
	КонецПроцедуры
	
	Процедура ЗаполнитьЗапасыПоДокументыОснования()
		
		Запасы.Очистить();
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_ТранспортировочныеПартии") Тогда
			
			ЗаполнитьПоТранспортировочнойПартии(ДокументОснование);
			
		КонецЕсли
		
	КонецПроцедуры  //ЗаполнитьПартииПоДокументыОснования()
	
	
	#КонецОбласти
	
#КонецЕсли

Процедура Конец()	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Отменим привязку в документе основании
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;	
	КонецЕсли; 
	
	Попытка
		ТрОбъект = ДокументОснование.ПолучитьОбъект();
		
		ТрОбъект.Факт   = Ложь;
		ТрОбъект.ДокументПогрузки = Документы.алк_ПогрузкаСудовыхПартий.ПустаяСсылка();
		
		тчЗапасы = ТрОбъект.Запасы;
		
		Для каждого стрЗапас Из тчЗапасы Цикл
			стрЗапас.Исключен = Ложь;	
		КонецЦикла; 
		
		ТрОбъект.Записать();
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка записи документа " + ТрОбъект.Ссылка + " " + ОписаниеОшибки();
		Сообщение.Сообщить();
		//ОписаниеОшибки()
	КонецПопытки; 
	
КонецПроцедуры
